{
    "note": "This file contains nearly all messages the bot sends to users. If you want to modify messages, read here: https://github.com/HerrEurobeat/steam-comment-service-bot/wiki/How-to-add-custom-messages",

    "updaterautoupdatedisabled": "You have disabled the automatic updater. Would you like to update now?\nIf yes, please force an update using the command: cmdprefixupdate true",

    "commentcmdusageowner": "'cmdprefixcomment amount/\"all\" id' to request amount many comments (or the max possible amount).\nProvide a profile, group or sharedfile (screenshot, artwork or guide) ID if you'd like to comment somewhere else instead of on your profile.",
    "commentcmdusageowner2": "'cmdprefixcomment 1 id'. Provide a profile, group or sharedfile (screenshot, artwork or guide) ID if you'd like to comment somewhere else instead of on your profile.",
    "commentcmdusage": "'cmdprefixcomment amount/\"all\"' to request amount many comments (or the max possible amount) on your profile.",
    "commentcmdusage2": "'cmdprefixcomment' to request a comment on your profile!",
    "commentrequesttoohigh": "You can request max. maxRequestAmount comments.\nCommand usage: commentcmdusage",
    "commentinvalidid": "This does not seem to be a valid profile, group or sharedfile (screenshot, artwork or guide) ID!\nPlease make sure that you either provide a full link, only the vanity or only the ID, pointing to an existing profile, group or sharedfile.\n\nCommand usage: commentcmdusage",
    "commentprofileidowneronly": "Specifying a ID is only allowed for bot owners.\nIf you are a bot owner, please make sure that you have added your ID to the ownerid setting in the config.json.",
    "commentmissingnumberofcomments": "Please specify how many comments out of maxRequestAmount you would like to request.\nCommand usage: commentcmdusage",
    "commentzeroavailableaccs": "Sorry but there are currently not enough accounts available to fulfill your request. Please wait waittime and try again!",
    "commentnotenoughavailableaccs": "Sorry but there are currently not enough accounts available to fulfill your request. Please wait waittime and try again or only request availablenow comments now.",
    "commentnoaccounts": "Sorry but there are no accounts to fulfill this request. Please contact the bot administrator of this instance.\nUse the cmdprefixowner command to get information about who runs this instance.",
    "commentnounlimitedaccs": "Sorry but there are no unlimited accounts which are needed to fulfill this request. Please contact the bot administrator of this instance.\nUse the cmdprefixowner command to get information about who runs this instance.",
    "commentaddbotaccounts": "Please add these accounts and then request again: (limited accounts)",
    "commentuserprofileprivate": "Your/the receiving profile seems to be private. Please edit the privacy settings to allow comments and try again!",
    "commenterroroccurred": "Oops, an error occurred! I sadly wasn't able to comment.",
    "commentprocessstarted": "Estimated wait time for numberOfComments comments: waittime.",
    "commentfailedcmdreference": "To get detailed information why which comment failed please type 'cmdprefixfailed'. You can read what probably caused your error here: https://github.com/HerrEurobeat/steam-comment-service-bot/wiki/Errors,-FAQ-&-Common-problems",
    
    "comment429stop": "Stopped comment process because all proxies had a HTTP 429 (IP cooldown) error. Please try again later. Failed: failedamount/numberOfComments",
    "commentretrying": "failedamount/numberOfComments comments have failed. I'm going to retry the failed comments in untilStr. (Attempt thisattempt/maxattempt)",
    "commentsuccess": "All comments have been sent. Failed: failedamount/numberOfComments\nIf you are a nice person then please comment on my profile too!",

    "votenoaccounts": "Sorry but there are no unlimited accounts available which haven't voted on this item yet.",
    "voterequestless": "There are currently only availablenow bot accounts available which have not yet voted on this item.",
    "votenotenoughavailableaccs": "Sorry but there are currently not enough accounts available which haven't voted on this item yet. Please wait waittime and try again or only request availablenow votes now.",
    "voteprocessstarted": "Estimated wait time for numberOfVotes votes: waittime.",
    "votesuccess": "All votes have been sent. Failed: failedamount/numberOfVotes",

    "favoritenoaccounts": "Sorry but there are no accounts available for this request on this id.",
    "favoriterequestless": "There are currently only availablenow bot accounts available for this request on this id.",
    "favoritenotenoughavailableaccs": "Sorry but there are currently not enough accounts available for this request on this id. Please wait waittime and try again or only request availablenow now.",
    "favoriteprocessstarted": "Estimated wait time for numberOfFavs un-/favorites: waittime.",
    "favoritesuccess": "All un-/favorites have been sent. Failed: failedamount/numberOfFavs",
    
    "useradded": "Hello there! Thanks for adding me!\nRequest a free comment with cmdprefixcomment\nType cmdprefixhelp for more commands or cmdprefixabout for more information!",
    "userunfriend": "You have been unfriended for being inactive for forceFriendlistSpaceTime days as the friendlist was running low on space.\nIf you need me again, feel free to add me again!",
    "userforceunfriend": "You have been unfriended for being inactive for unfriendtime days.\nIf you need me again, feel free to add me again!",

    "userspamblock": "You have been blocked for 90 seconds for spamming.",
    "usernotfriend": "Please add me before using a command!",
    "botnotready": "The bot is not completely started yet. Please wait a moment before using a command.",
    "commandnotfound": "I don't know that command. Type cmdprefixhelp for more info.",
    "commandowneronly": "This command is only available for owners.\nIf you are the botowner, make sure you added your ownerid to the config.json.",

    "invalidnumber": "This does not seem to be a valid number!\n\nCommand usage: cmdusage",
    "invalidprofileid": "This does not seem to be a valid ID or link or you provided the wrong ID type for this command!\nPlease make sure that you either provide a full link, only the vanity or only the ID, pointing to an existing profile, group or sharedfile.",
    "invalidgroupid": "This is not a valid group id or group url! \nA groupid must look like this: '103582791464712227' \n...or a group url like this: 'https://steamcommunity.com/groups/3urobeatGroup'",
    "invalidsharedfileid": "This does not seem to be a valid sharedfileID!\nPlease make sure that you either provide a full link: https://steamcommunity.com/sharedfiles/filedetails/?id=2980913451 ...or just the ID: 2980913451 ...which points to an existing screenshot, artwork or guide.\n\nCommand usage: cmdusage",
    "errloadingsharedfile": "Sorry but an error occurred while loading the sharedfile you have provided: ",
    "idisownererror": "You are not allowed to provide the ID of an owner!",
    "idalreadyreceiving": "This user or id already has an active request! Please wait for it to be completed before requesting again.",
    "idoncooldown": "You only recently started a request. Please wait the remaining remainingcooldown before starting another request.",
    "requestaborted": "Your active request was manually aborted by either yourself or an owner.\nsuccessAmount/totalAmount have been sent successfully.",

    "reloadcmdreloaded": "Reloaded all commands and plugins.",
    "activerelog": "The bot is currently waiting for the last active requests to be finished in order to relog accounts.\nPlease wait a few minutes and try again.",
    "updatecmdforce": "Forcing an update from the branchname branch...",
    "updatecmdcheck": "Checking for an update in the branchname branch...",
    "restartcmdrestarting": "Restarting...",
    "stopcmdstopping": "Stopping...",

    "helpcommandlist": "Command list:",
    "helpcommentowner1": "Request x many or the max amount of comments (max maxOwnerComments). Provide a profileid to comment on a specific profile.",
    "helpcommentowner2": "Request 1 comment (max amount with current settings). Provide a profile id to comment on a specific profile.",
    "helpcommentuser1": "Request x many or the max amount of comments (max maxComments).",
    "helpcommentuser2": "Request a comment on your profile!",
    "helpping": "Get a pong and response time from Steam in ms.",
    "helpinfo": "Get useful information about the bot and you.",
    "helpabort": "Abort your own requested comment process.",
    "helpabout": "Returns information about this bot, including a link to GitHub.",
    "helpowner": "Get a link to the profile of the operator/host of this bot instance.",
    "helpjoingroup": "Join my 'cmdprefixgroup'!",
    "helpreadothercmdshere": "To keep this message short please read all other commands here:",

    "pingcmdmessage": "Pong! 🏓\nTime to steamcommunity.com/ping response: pingtimems",
    "ownercmdnolink": "The operator of this bot didn't include a link to him/herself.)",
    "ownercmdmsg": "Check out my owner's profile: (for more information about the bot type cmdprefixabout)",
    "groupcmdnolink": "The botowner of this instance hasn't provided any group or the group doesn't exist.",
    "groupcmdinvitesent": "I sent you an invite! Thanks for joining!",
    "groupcmdinvitelink": "Join my group here: ",
    "abortcmdnoprocess": "There is no active comment process running for this ID.\nIf you requested comments for another profile, group or sharedfile then please provide that ID as argument!",
    "abortcmdsuccess": "Aborting your active comment process...",

    "resetcooldowncmdcooldowndisabled": "The cooldown is disabled in the config!",
    "resetcooldowncmdglobalreset": "The cooldown of all bot accounts has been reset.",
    "resetcooldowncmdsuccess": "profileid's cooldown has been cleared.",

    "settingscmdfailedread": "Failed to read config to output current settings: ",
    "settingscmdcurrentsettings": "Current settings:",
    "settingscmdblockedvalues": "enableevalcmd, ownerid and owner can't be changed via the settings command for security reasons. Please do it directly in the config file.",
    "settingscmdkeynotfound": "I can't find this key in the config.",
    "settingscmdsamevalue": "The requested key is already value.",
    "settingscmdvaluetoobig": "Your new value is too big. (32-bit integer limit)\nPlease choose a smaller value.",
    "settingscmdvaluechanged": "targetkey has been changed from oldvalue to newvalue.\nPlease remember that certain values might need a restart to take effect. You can do that by typing cmdprefixrestart.",

    "failedcmdnothingfound": "I can't remember any failed comments on your/that ID.\nIf you requested comments for another profile, group or sharedfile then please provide that ID as argument!",
    "failedcmdmsg": "Your last request for 'steamID64' finished at 'requesttime' (GMT time) had these errors:",

    "sessionscmdnosessions": "There are currently no active sessions and no bot accounts on cooldown.",
    "sessionscmdmsg": "There are currently amount active session(s):",
    "mysessionscmdnosessions": "There are currently no active sessions that you have started.",

    "addfriendcmdacclimited": "Can't add friend profileid with bot0 because the bot account is limited.",
    "addfriendcmdsuccess": "Adding friend profileid with all bot accounts... This will take ~estimatedtime seconds. Please check the log for potential errors.",
    "unfriendcmdsuccess": "I am unfriending you with all bot accounts. This will take a moment...\nYou can send me a friend request again at any time.",
    "unfriendidcmdsuccess": "Removed friend profileid from all bot accounts.",

    "unfriendallcmdabort": "Aborting unfriendall process if one is active...",
    "unfriendallcmdpending": "Unfriending all people (except owners) with all bot accounts in 30 seconds...\nType 'cmdprefixunfriendall abort' to abort/stop the process.",
    "unfriendallcmdstart": "Starting to unfriend everyone...",

    "joingroupcmdsuccess": "Joining group 'groupid' with all bot accounts...",

    "leavegroupcmdsuccess": "Leaving group 'groupid' with all bot accounts...",

    "leaveallgroupscmdabort": "Aborting leaveallgroups process if one is active...",
    "leaveallgroupscmdpending": "Leaving all groups (except yourgroup and botsgroup) with all bot accounts in 15 seconds...\nType 'cmdprefixleaveallgroups abort' to abort/stop the process.",
    "leaveallgroupscmdstart": "Starting to leave all groups...",

    "blockcmdsuccess": "Blocked profileid with all bot accounts.",
    "unblockcmdsuccess": "Unblocked profileid with all bot accounts.",

    "evalcmdturnedoff": "The eval command has been turned off!",
    "evalcmdlogininfoblock": "Your code includes 'logininfo'. In order to protect passwords this is not allowed.",

    "childbotmessage": "This is one account running in a bot cluster.\nPlease add the main bot and send him a cmdprefixhelp message.\nIf you want to check out what this is about, type: cmdprefixabout"
}