{
    "note": "This file contains nearly all messages the bot sends via the steam chat. If you want to modify messages, read here: https://github.com/HerrEurobeat/steam-comment-service-bot/wiki/How-to-add-custom-messages",

    "pleasedontspam": "/me Please don't spam this command.",
    "commentactiveupdate": "The bot is currently waiting for the last requested comment to be finished in order to download an update!\nPlease wait a moment and try again.",
    "commentcmdowneronly": "The bot owner set this command to owners only.\nType !owner to get information who the owner is.\nType !about to get a link to the bot creator.",
    "commentcmdusageowner": "'!comment number_of_comments/\"all\" profileid' for X many or the max amount of comments (max maxrequestamount). Provide a profile id to comment on a specific profile.",
    "commentcmdusageowner2": "'!comment 1 profileid'. Provide a profile id to comment on a specific profile.",
    "commentcmdusage": "'!comment number_of_comments/\"all\"' for X many or the max amount of comments (max maxrequestamount).",
    "commentcmdusage2": "'!comment' for a comment on your profile!",
    "commentuseroncooldown": "You requested a comment in the last commentcooldown minutes. Please wait the remaining remainingcooldown timeunit.",
    "commentuseralreadyrecieving": "This profile is currently recieving previously requested comments. Please wait for them to be completed.",
    "commentglobaloncooldown": "Someone else requested a comment in the last botaccountcooldown minutes or Steam has applied a cooldown on this account.\nPlease wait the remaining remainingglobalcooldown timeunit before trying again.",
    "commentinvalidnumber": "This is not a valid number!\nCommand usage: commentcmdusage",
    "commentrequesttoohigh": "You can request max. maxrequestamount comments.\nCommand usage: commentcmdusage",
    "commentinvalidid": "This is not a valid id! A profile id must look like this: 76561198260031749  ...or a group id like this: 103582791464712227\nCommand usage: commentcmdusage",
    "commentprofileidowneronly": "Specifying a profileid is only allowed for bot owners.\nIf you are a bot owner, make sure you added your ownerid to the config.json.",
    "commentmissingnumberofcomments": "Please specify how many comments out of maxrequestamount you would like to request.\nCommand usage: commentcmdusage",
    "commentzeroavailableaccs": "Sorry but there are currently not enough accounts available to fulfill your request because somone else just requested comments too. Please wait waittime timeunit and try again.",
    "commentnotenoughavailableaccs": "Sorry but there are currently not enough accounts available to fulfill your request because somone else just requested comments too. Please wait waittime timeunit and try again or only request availablenow comments now.",
    "commentaddbotaccounts": "In order to request numberofcomments comments you/the recieving user will need to add these accounts and then request comments again: (limited bot accounts)",
    "commentuserprofileprivate": "Your/the recieving profile seems to be private. Please edit your/the privacy settings on your/the recieving profile and try again!",
    "commenterroroccurred": "Oops, an error occurred!",
    "commentsuccess1": "Okay I commented on/in your/the recieving profile/group! If you are a nice person then please comment on my profile too!",
    "commentprocessstarted": "Estimated wait time for numberofcomments comments: waittime timeunit.",
    "commentfailedcmdreference": "To get detailed information why which comment failed please type '!failed'. You can read what probably caused your error here: https://github.com/HerrEurobeat/steam-comment-service-bot/wiki/Errors,-FAQ-&-Common-problems",
    "comment429stop": "Stopped comment process because all proxies had a HTTP 429 (IP cooldown) error. Please try again later. Failed: failedamount/numberofcomments",
    "commentsuccess2": "All comments have been sent. Failed: failedamount/numberofcomments\nIf you are a nice person then please comment on my profile too!",
    "commentlimitederror": "-----------------------------------\nIt seems like at least one of the requested comments could have failed because you/the recieving account aren't/isn't friend with the commenting bot account.\n\nPlease make sure that you have added these accounts in order to eventually avoid this error in the future: \naccstoadd\n-----------------------------------",

    "useradded": "Hello there! Thanks for adding me!\nRequest a free comment with !comment\nType !help for more commands or !about for more information!",
    "userspamblock": "/me You have been blocked for 60 seconds for spamming.",
    "usernotfriend": "/me Please add me before using a command!",
    "botnotready": "/me The bot is not completely started yet. Please wait a moment before using a command.",
    "botmaintenance": "/me The comment command is currently unavailable for maintenance. Please wait a bit.",
    "commandowneronly": "This command is only available for the botowner.\nIf you are the botowner, make sure you added your ownerid to the config.json.",
    "invalidprofileid": "This is not a valid profileid! A profile id must look like this: 76561198260031749",

    "helpcommandlist": "Command list:",
    "helpcommentowner1": "Request x many or the max amount of comments (max maxOwnerComments). Provide a profileid to comment on a specific profile.",
    "helpcommentowner2": "Request 1 comment (max amount with current settings). Provide a profile id to comment on a specific profile.",
    "helpcommentuser1": "Request x many or the max amount of comments (max maxComments).",
    "helpcommentuser2": "Request a comment on your profile!",
    "helpping": "Get a pong and response time from Steam in ms.",
    "helpinfo": "Get useful information about the bot and you.",
    "helpabort": "Abort your own requested comment process.",
    "helpabout": "Returns information about this bot, including a link to GitHub.",
    "helpowner": "Get a link to the profile of the operator/host of this bot instance.",
    "helpjoingroup": "Join my '!group'!",
    "helpreadothercmdshere": "To keep this message short please read all other commands here:",

    "pingcmdmessage": "Pong! 🏓\nTime to steamcommunity.com/ping response: pingtimems",
    "ownercmdnolink": "The operator of this bot didn't include a link to him/herself.)",
    "ownercmdmsg": "Check out my owner's profile: (for more information about the bot type !about)",
    "groupcmdnolink": "The botowner of this instance hasn't provided any group or the group doesn't exist.",
    "groupcmdinvitesent": "I sent you an invite! Thanks for joining!",
    "groupcmdinvitelink": "Join my group here: ",
    "abortcmdnoprocess": "/me There is no active comment process running for this profile.\nIf you requested comments for another profile or for a group then please provide the id as argument!",
    "abortcmdsuccess": "/me Aborting your active comment process...",

    "resetcooldowncmdcooldowndisabled": "The cooldown is disabled in the config!",
    "resetcooldowncmdglobalreset": "The cooldown of all bot accounts has been reset.",
    "resetcooldowncmdsuccess": "profileid's cooldown has been cleared.",

    "settingscmdfailedread": "Failed to read config to output current settings: ",
    "settingscmdcurrentsettings": "Current settings:",
    "settingscmdblockedvalues": "enableevalcmd, ownerid and owner can't be changed via the settings command for security reasons. Please do it directly in the config file.",
    "settingscmdkeynotfound": "I can't find this key in the config.",
    "settingscmdsamevalue": "The requested key is already value.",
    "settingscmdvaluetoobig": "Your new value is too big. (32-bit integer limit)\nPlease choose a smaller value.",
    "settingscmdvaluechanged": "targetkey has been changed from oldvalue to newvalue.\nPlease remember that certain values might need a restart to take effect. You can do that by typing !restart.",

    "failedcmdnothingfound": "I can't remember any failed comments on your/that profile.\nIf you requested comments for another profile or for a group then please provide the id as argument!",
    "failedcmdmsg": "Your last request for 'steam64id' from 'requesttime' (GMT time) had these errors:",

    "sessionscmdnosessions": "There are currently no active sessions and no bot accounts on cooldown.",
    "sessionscmdmsg": "There are currently amount active session(s):",
    "mysessionscmdnosessions": "There are currently no active sessions that you have started.",

    "addfriendcmdacclimited": "Can't add friend profileid with bot0 because the bot account is limited.",
    "addfriendcmdsuccess": "Adding friend profileid with all bot accounts... This will take ~estimatedtime seconds. Please check the log for potential errors.",
    "unfriendcmdsuccess": "I am unfriending you with all bot accounts. This will take a moment...\nYou can send me a friend request again at any time.",
    "unfriendidcmdsuccess": "Removed friend profileid from all bot accounts.",

    "unfriendallcmdabort": "Aborting unfriendall process if one is active...",
    "unfriendallcmdpending": "Unfriending all people (except owners) with all bot accounts in 30 seconds...\nType '!unfriendall abort' to abort/stop the process.",
    "unfriendallcmdstart": "/me Starting to unfriend everyone...",

    "leavegroupcmdinvalidgroup": "This is not a valid group id or group url! \nA groupid must look like this: '103582791464712227' \n...or a group url like this: 'https://steamcommunity.com/groups/3urobeatGroup'",
    "leavegroupcmdnotfound": "I was unable to find a group with the URL you specified!",
    "leavegroupcmderror": "Couldn't get leavegroup information. Either Steam is down or your internet isn't working.\nError: ",
    "leavegroupcmdsuccess": "Left group 'profileid' with all bot accounts.",

    "leaveallgroupscmdabort": "/me Aborting leaveallgroups process if one is active...",
    "leaveallgroupscmdpending": "Leaving all groups (except yourgroup and botsgroup) with all bot accounts in 15 seconds...\nType '!leaveallgroups abort' to abort/stop the process.",
    "leaveallgroupscmdstart": "/me Starting to leave all groups...",

    "blockcmdsuccess": "/me Blocked profileid with all bot accounts.",
    "unblockcmdsuccess": "/me Unblocked profileid with all bot accounts.",
    "restartcmdrestarting": "/me Restarting...",
    "stopcmdstopping": "/me Stopping...",
    "updatecmdforce": "/me Forcing an update from the branchname branch...",
    "updatecmdcheck": "/me Checking for an update in the branchname branch...",

    "evalcmdturnedoff": "/me The eval command has been turned off!",
    "evalcmdlogininfoblock": "Your code includes 'logininfo'. In order to protect passwords this is not allowed.",

    "commandnotfound": "I don't know that command. Type !help for more info.",
    "childbotmessage": "This is one account running in a bot cluster.\nPlease add the main bot and send him a !help message.\nIf you want to check out what this is about, type: !about"
}